In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name":['harry','rohan','maaz'],
    "marks":[23,43,34],
    "city":['india','US','Pak']
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

    name  marks   city
0  harry     23  india
1  rohan     43     US
2   maaz     34    Pak

In [5]:
df.to_csv('friends_index_false.csv', index= False)

In [6]:
df.head(2)

    name  marks   city
0  harry     23  india
1  rohan     43     US

In [7]:
df.tail(2)

    name  marks city
1  rohan     43   US
2   maaz     34  Pak

In [8]:
df.describe()

           marks
count   3.000000
mean   33.333333
std    10.016653
min    23.000000
25%    28.500000
50%    34.000000
75%    38.500000
max    43.000000

In [9]:
maaz = pd.read_csv('maaz.csv')

In [10]:
maaz

   Train.No  speed Country
0       123     40   india
1       124    332      US
2       125    324     Pak
3       126    233      UK

In [11]:
maaz['speed'][0] = 40

C:\Users\maaz abbas\AppData\Local\Temp\ipykernel_6032\3225726996.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  maaz['speed'][0] = 40

In [12]:
maaz

   Train.No  speed Country
0       123     40   india
1       124    332      US
2       125    324     Pak
3       126    233      UK

In [13]:
maaz.to_csv('maaz.csv', index = False)

In [14]:
maaz

   Train.No  speed Country
0       123     40   india
1       124    332      US
2       125    324     Pak
3       126    233      UK

In [15]:
maaz.index = ['first', 'second', 'third','four']

In [16]:
maaz

        Train.No  speed Country
first        123     40   india
second       124    332      US
third        125    324     Pak
four         126    233      UK

In [17]:
ser = pd.Series(np.random.rand(32))

In [18]:
type(ser)

pandas.core.series.Series

In [19]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [20]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0    0.378218  0.840199  0.469853  0.379839  0.372147
1    0.560726  0.869065  0.522389  0.534680  0.131337
2    0.745614  0.143612  0.925786  0.270269  0.912070
3    0.557317  0.066422  0.832280  0.081698  0.583537
4    0.612928  0.489244  0.310632  0.215376  0.288262
..        ...       ...       ...       ...       ...
329  0.750107  0.956940  0.039420  0.242141  0.398346
330  0.444970  0.753536  0.237167  0.536298  0.345168
331  0.262790  0.608166  0.835157  0.204831  0.800280
332  0.330267  0.031438  0.744661  0.436308  0.114450
333  0.876134  0.163846  0.343762  0.133900  0.509381

[334 rows x 5 columns]>

In [21]:
newdf

            0         1         2         3         4
0    0.378218  0.840199  0.469853  0.379839  0.372147
1    0.560726  0.869065  0.522389  0.534680  0.131337
2    0.745614  0.143612  0.925786  0.270269  0.912070
3    0.557317  0.066422  0.832280  0.081698  0.583537
4    0.612928  0.489244  0.310632  0.215376  0.288262
..        ...       ...       ...       ...       ...
329  0.750107  0.956940  0.039420  0.242141  0.398346
330  0.444970  0.753536  0.237167  0.536298  0.345168
331  0.262790  0.608166  0.835157  0.204831  0.800280
332  0.330267  0.031438  0.744661  0.436308  0.114450
333  0.876134  0.163846  0.343762  0.133900  0.509381

[334 rows x 5 columns]

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.505647    0.487490    0.514964    0.513372    0.495316
std      0.282243    0.299671    0.282614    0.288330    0.280490
min      0.004207    0.000639    0.000603    0.000134    0.000657
25%      0.277326    0.205891    0.293465    0.276980    0.268105
50%      0.495691    0.481667    0.504368    0.525126    0.492507
75%      0.750076    0.751585    0.773612    0.756655    0.721771
max      0.996034    0.999622    0.992077    0.991265    0.999344

In [ ]:
newdf.dtypes

In [ ]:
newdf[0][0] = 'maaz'

In [ ]:
newdf()

In [ ]:
newdf.head()

In [ ]:
newdf.index

In [ ]:
newdf.columns

In [ ]:
newdf.to_numpy()

In [ ]:
newdf[0][0]= 0.4

In [ ]:
newdf.T

In [ ]:
newdf.head()

In [ ]:
newdf.sort_index(axis= 1, ascending = False)

In [ ]:
newdf.head()

In [ ]:
type(newdf[0])

In [ ]:
newdf.head()

In [ ]:
newdf2 = newdf.copy()

In [ ]:
newdf2[0][0] = 342532

In [ ]:
newdf

In [ ]:
newdf2

In [ ]:
newdf.loc[0,0] = 234

In [ ]:
newdf.head()

In [ ]:
newdf.columns = list ("ABCDF")

In [ ]:
newdf

In [ ]:
newdf.loc

In [ ]:
newdf.iloc[[0,5],[1,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop([1, 2], axis = 1 , inplace= True)

In [ ]:
newdf

In [ ]:
newdf.reset_index(drop = True, inplace = True)

In [ ]:
newdf.head(3)

In [ ]:
newdf[3].add_prefixisnull()

In [ ]:
newdf(0, axis = 1) = None